{
  "version": "0.1.0",
  "url": "https://raw.githubusercontent.com/BaoBao666888/Novel-Downloader5/refs/heads/main/rename_chapters/0.1.0/Rename-Chapters-setup.exe",
  "notes": "Phiên bản 0.1.0 — Cập nhật lớn (UI & Sửa lỗi)\n\nCám ơn bạn đã dùng Rename Chapters — bản cập nhật này tập trung vào trải nghiệm người dùng, sửa các lỗi quan trọng và giới thiệu tính năng cập nhật hoàn toàn mới.\n\n----------------------------------------------------\nTÍNH NĂNG NỔI BẬT\n----------------------------------------------------\n\n[MỚI] Giao diện cập nhật mới\n- Giờ đây, ứng dụng có thể tự động kiểm tra và thông báo cho bạn khi có phiên bản mới.\n- Cung cấp chi tiết các thay đổi ngay trong cửa sổ cập nhật.\n- Hỗ trợ tải và cài đặt tự động hoặc mở link bằng trình duyệt làm phương án dự phòng.\n\n[MỚI] Giao diện có thể kéo/thả để đổi kích thước\n- Các khung trong mỗi tab (Tùy chọn, Xem trước,...) giờ đây có thể kéo để thay đổi kích thước, giúp bạn tùy chỉnh không gian làm việc thoải mái hơn.\n\n[MỚI] Chỉnh sửa nhanh từ tab \"Đổi Tên\"\n- Double-click vào một file trong danh sách xem trước để mở cửa sổ xem nhanh nội dung.\n- Từ đó, nhấn nút \"Chỉnh sửa\" để nhảy thẳng đến tab \"Xử lý Văn bản\" và bắt đầu sửa file ngay lập tức.\n\n[CẢI TIẾN] Tối ưu không gian và di chuyển nút bấm\n- Các nút chức năng đã được sắp xếp lại hợp lý hơn để tăng diện tích cho việc hiển thị nội dung.\n\n[SỬA LỖI] Xem trước khi \"Chia file\"\n- Đã sửa lỗi nghiêm trọng khiến cửa sổ xem trước của chức năng \"Chia file\" hiển thị kích thước (số byte) thay vì nội dung thực tế của phần được chia.\n\n[CẢI TIẾN] Tự động tải file\n- Khi chuyển sang tab \"Xử lý Văn bản\", ứng dụng sẽ tự động tải file bạn đã chọn gần nhất, không cần phải chọn lại thủ công.\n\n----------------------------------------------------\nHƯỚNG DẪN CẬP NHẬT\n----------------------------------------------------\n\n- Nhấn \"Tải & Cài đặt\" để download bản cài đặt (.exe) tự động.\n- Ứng dụng sẽ đóng để bộ cài khởi chạy và cập nhật.\n- Nếu muốn giữ bản cũ hoặc tải thủ công, nhấn \"Mở bằng trình duyệt\".",
  "notes_file": "https://raw.githubusercontent.com/BaoBao666888/Novel-Downloader5/refs/heads/main/rename_chapters/update_notes.html"
}
